#include <stdio.h>
#include <locale.h>

int main()
{
	setlocale(LC_ALL, "RUS");

	printf("123\n"); // подзадание 1

	printf("\n1\n2\n3\n"); // подзадание 2

	printf("\n 1\n\t2\n\t\t3\n\n"); // подзадание 3

	printf("%2d\n", 1);
	printf("%4d\n", 2);
	printf("%6d\n", 3);
	printf("%8d\n", 4); // подзадание 4

	printf("\n%10.3f\n ", 12.234657);// подзадание 5

	printf("\n%10.5f\n ", 12.234657);// подзадание 6

	printf("\n Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2); // подзадание 7
	printf("\n Остаток от деления %d на %d равен %d\n ", 7, 5, 7 % 5); // подзадание 8
	printf("\n Произведение %d и %d равено %d\n ", 2000, 4, 2000 * 4); // подзадание 9

	printf("\n %g разделить %e равно %f\n ", 5., 2000000., 5. / 2000000); // подзадание 10
	printf("\n %d разделить %d равно %d\n ", 5., 2000000., 5. / 2000000); //10.1
	printf("\n %f разделить %f равно %f\n ", 5., 2000000., 5. / 2000000); //10.2
	printf("\n %g разделить %g равно %g\n ", 5., 2000000., 5. / 2000000); //10.3
	printf("\n %e разделить %e равно %e\n ", 5., 2000000., 5. / 2000000); //10.4

}
